In [1]:
url = "http://vps-40d69db1.vps.ovh.ca:21446/api/CotacaoIntradayAcaoResultadoValors/obtemPorRegraData?idRegra=1&diaNum=20211001"

In [2]:
import requests
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from datetime import datetime

In [3]:
r = requests.get(url)
j = r.json()
df = pd.DataFrame.from_dict(j)

## Piores ( Venda )

In [4]:
dfVenda = df.loc[df['resultado']==-1]

In [5]:
dfVenda.sort_values(by='qtde', ascending=False).head(10)

    ticker  resultado  qtde
100  LREN3         -1   736
52   CVCB3         -1   662
107  MRFG3         -1   568
103  LWSA3         -1   568
3    AZUL4         -1   541
57   ECOR3         -1   540
105  MGLU3         -1   536
116  NTCO3         -1   521
21   BRAP4         -1   482
168  WIZS3         -1   481

## Melhores (Compra)

In [6]:
dfCompra = df.loc[df['resultado']==1]

In [7]:
dfCompra.sort_values(by='qtde', ascending=False).head(10)

    ticker  resultado  qtde
127  POSI3          1   532
152  SUZB3          1   501
99   LCAM3          1   430
15   BEEF3          1   394
140  RENT3          1   391
67   EMBR3          1   377
83   GOLL4          1   342
161  USIM5          1   316
147  STBP3          1   303
158  UGPA3          1   300

## Casos Interessantes

In [8]:
df.loc[df['ticker']=='POSI3']

    ticker  resultado  qtde
125  POSI3         -1   187
126  POSI3          0    10
127  POSI3          1   532

In [10]:
df.loc[df['ticker']=='SUZB3']

   ticker  resultado  qtde
54  GOLL4         -1   337
55  GOLL4          1   342

In [9]:
df.loc[df['ticker']=='LCAM3']

   ticker  resultado  qtde
97  LCAM3         -1   204
98  LCAM3          0     5
99  LCAM3          1   430

In [12]:
df.loc[df['ticker']=='RENT3']

   ticker  resultado  qtde
91  RENT3         -1   173
92  RENT3          0    12
93  RENT3          1   391

In [13]:
df.loc[df['ticker']=='USIM5']

    ticker  resultado  qtde
105  USIM5         -1   284
106  USIM5          0     2
107  USIM5          1   316

In [14]:
df.loc[df['ticker']=='LREN3']

   ticker  resultado  qtde
65  LREN3         -1   723
66  LREN3          0     1
67  LREN3          1     1

In [15]:
df.loc[df['ticker']=='MRFG3']

   ticker  resultado  qtde
72  MRFG3         -1   568
73  MRFG3          0    15
74  MRFG3          1    20